console.log("Завдання: 7 ==============================");

// Створюємо функцію task7, яка використовує setInterval та проміси.
function task7() {
  const promise = new Promise((resolve, reject) => {
    // Використовуємо setInterval, щоб виконати функцію кожну секунду.
    const intervalId = setInterval(() => {
      // Отримаємо поточну дату та час.
      const currentDate = new Date();

      // Отримуємо секунди з поточної дати.
      const seconds = currentDate.getSeconds();

      // Виводимо в консоль повідомлення про поточні секунди.
      console.log(`Поточні секунди: ${seconds}`);

      // Якщо поточні секунди кратні 10, очищуємо інтервал та резолвимо проміс.
      if (seconds % 10 === 0) {
        clearInterval(intervalId);
        resolve("Поточні секунди кратні 10!");
      }

      // Якщо поточні секунди кратні 3, очищуємо інтервал та відхиляємо проміс.
      if (seconds % 3 === 0) {
        clearInterval(intervalId);
        reject("Поточні секунди кратні 3!");
      }
    }, 1000); // Інтервал виконання кожну секунду.
  });

  // Використовуємо then для обробки зарезолвленого проміса та виводимо результат в консоль.
  promise
    .then((value) => {
      console.log(`Проміс зарезолвився з значенням: ${value}`);
    })
    // Обробляємо помилку за допомогою catch та виводимо її в консоль.
    .catch((error) => {
      console.error(`Проміс відхилився з помилкою: ${error}`);
    })
    // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо повідомлення в консоль.
    .finally(() => {
      console.log("Проміс завершено");
    });
  // Створюємо новий проміс.
  // Використовуємо функцію setInterval, щоб виконати функцію кожну секунду.
  // Отримаємо поточну дату та час
  // Отримуємо секунди з поточної дати
  // Виводимо в консоль повідомлення `Поточні секунди: ${seconds}`
  // Якщо поточні секунди кратні 10, очищуємо інтервал та резолвимо проміс з рядком "Поточні секунди кратні 10!".
  // Якщо поточні секунди кратні 3, очищуємо інтервал та відхиляємо проміс з рядком "Поточні секунди кратні 3!".
  // Використовуємо then для обробки зарезолвленого проміса, та виводимо в консоль `Проміс зарезолвився з значенням: ${value}` .
  // Якщо проміс відхилено, обробляємо помилку за допомогою catch, та виводимо в консоль `Проміс відхилився з помилкою: ${error}`.
  // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо в консоль "Проміс завершено".
}

// Викликаємо функцію task7
task7();
